function getStory() {
    var mood = document.getElementById("mood").value;
    var storyContainer = document.getElementById("story-container");
    var story = "";

    switch (mood) {
        case "happy":
            story = "मनोरंजन के लिए एक सुंदर गाँव, जहाँ प्रकृति की सुंदरता हर किसी को मोहित करती थी। एक सुनहरी सुबह, सूर्य की किरणें सभी को आशीर्वाद देती थीं। लोग आपस में मुस्कुरा रहे थे और खुशियों की बातें कर रहे थे। गाँव के मन्ने बच्चे खेलने के लिए उत्सुक थे, और उनके चेहरे पर निरंतर हंसी की मुस्कान थी। सुंदर प्रकृति और खुशियों का माहौल, गाँव को सचमुच स्वर्ग की भावना देता था।"

;
            break;
        case "sad":
            story = "जब आदमी दुःखी होता है, तो उसका दुख कारण के साथ अकेला रहता है। उसका मन कहीं भटक जाता है, और वह अपने अंदर की भावनाओं के सामना करता है। लेकिन ध्यान रखिए, हर बादल के पीछे सूरज कभी नहीं छुपता। जैसे ही अंधकार हटता है, सूरज की किरणें नई आशा और उत्साह लेकर आती हैं। दुःख का समापन हमें नई उम्मीदों की और ले जाता है।";
            break;
        case "angry":
            story = "जब किसी को गुस्सा आता है, तो वह अपनी आग और भड़काऊ भावनाओं को आज़माता है। उसकी आवाज़ उच्च होती है और उसकी आँखों में आग बढ़ जाती है। गुस्सा उसे अपने आप को जलाने की ताकत देता है, और उसके चिरों को भी जला देता है। लेकिन गुस्से के अंधेरे से निकलकर, अंत में शांति की किरणें चमकती हैं।";
            break;
        case "excited":
            story = "उत्साह वह अनुभव है जो दिल को सर्वोत्तम जीने की खुशी देता है। वह जोश और उत्सुकता उसकी आँखों में दिखाई देती है। जब उसे सफलता का आभास होता है, तो उसकी खुशी की कोई सीमा नहीं होती। उत्साह उस जोश की खुशबू है जो सफलता की ओर ले जाती है।";
            break;
        case "horror":
            story =   "रात के अंधेरे में, एक बुजुर्ग हवेली के रहस्यमय कोने में एक भयानक रोहताड़ बसा हुआ था। गाँव के लोग कहते थे कि वहाँ किसी अत्यंत असाधारण शक्ति का आवास है। एक रात, एक नौजवान लड़का उस हवेली में एकांतवास के लिए आया। जैसे ही रात बढ़ती गई, उसने वहाँ अनजान आवाज़ें सुनीं। उसका दिल तेजी से धड़कने लगा और वह डर के आवाज़ के पीछे भाग गया। लेकिन उसने वापस मुकाबला किया, और वहाँ जाकर देखा कि उसके सामने कुछ ऐसा था जिसने उसके बालों से ज़ुल्म किया।  धीरे-धीरे, उसके साथ घटी एक भयानक घटना जिसने उसकी आत्मा को हमेशा के लिए उस डरावनी रात का राज जानने को मजबूर कर दिया।";
            break;    
        default:
            story = "कुछ त्रुटि हुई है, कृपया दुबारा कोशिश करें।";
    }

    storyContainer.innerHTML = "<p>" + story + "</p>";
}
